## mising data in pandas

In [2]:
import pandas as pd
import numpy as np

In [6]:
from numpy import nan as NA

In [7]:
df =pd.DataFrame([[1,2,3],[4,None,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [10]:
df.isnull().sum()

0    1
1    2
2    1
dtype: int64

In [11]:
df.dropna(inplace=False)

     0    1    2
0  1.0  2.0  3.0

In [14]:
df_new = df.dropna(how="all")
df_new

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [13]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [17]:
df =pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df[1]=NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [18]:
df.dropna(axis=1,how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [19]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

## fil NAN value with other value

In [30]:
df.fillna(0)

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [31]:
df.fillna({0:15,1:25,2:35}, inplace=False)

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [ ]:
df =pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

## Forward fill -fill method propagates the last valid(non-null) value forward to replace anu missing values 

### axis = 0 fill column wise
### axis = 1 fill row wise

In [34]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [36]:
df.fillna(method="ffill",axis=1)

/var/folders/mq/8k37xryj0_n2cz69zl90f1gm0000gn/T/ipykernel_2448/3252714673.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",axis=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  4.0  5.0
2  NaN  NaN  NaN

## combining and merging datasets in pandas

### joining dataframe

In [38]:
d1 = pd.DataFrame(
    {
        "key":["a","b","c","c","d","e"],
        "num1":range(6)
    }
)

d2 = pd.DataFrame(
    {
        "key":["b","c","e","f"],
        "num2":range(4)
    }
)

In [40]:
d1

  key  num1
0   a     0
1   b     1
2   c     2
3   c     3
4   d     4
5   e     5

In [41]:
d2

  key  num2
0   b     0
1   c     1
2   e     2
3   f     3

In [42]:
pd.merge(d1,d2)

  key  num1  num2
0   b     1     0
1   c     2     1
2   c     3     1
3   e     5     2